Repository: sslavik/acdat
Catalog: TMXParser/en-es.tmx
Source language: en
Languages: es

source: ?php / / $xml and $xsl contain the XML and XSL data $arguments = array( '/ _xml' = $xml, '/ _xsl' = $xsl); / / Allocate a new XSLT processor $xh = xslt_create(); / / Process the document $result = xslt_process($xh, 'arg: / _xml', 'arg: / _xsl', NULL, $arguments); if ($result) {print "SUCCESS, sample.xml was transformed by sample.xsl into the \$result"; print "variable, the \$result variable has the following contents\n br \n"; print" pre \n"; print $result; print "/ pre \n";} else {print "Sorry, sample.xml could not be transformed by sample.xsl into"; print" the \$result variable the reason is that ". xslt_error($xh). print" and the error code is ". xslt_errno($xh);} xslt_free($xh);?
es: This function lacks a prototype definition.

source: SAX handlers should be a two dimensional array with the format (all top level elements are optional):
es: Set SAX handlers on the ressource handle given by xh.

source: YAZ functions
es: YAZ

source: Closes connection given by id.
es: Closes a connection to a target.

source: The id is a connection resource as returned by a previous yaz_connect() call.
es: The application can no longer refer to the target with the given id.

source: The error code is either a Z39.50 diagnostic code (usually a Bib-1 diagnostic) or a client side error code which is generated by PHP / YAZ itself, such as "Connect failed", "Init Rejected ", etc.
es: A positive value is returned if the target returned a diagnostic code; a value of zero is returned if no errors occurred (success); negative value is returned for other errors targets didn 't indicate the error in question.

source: Returns error text message for target (last request).
es: Returns error message for target (last request).

source: yaz_error() returns an english text message corresponding to the last error number as returned by yaz_errno().
es: yaz_error() returns a english message corresponding to the last error number as returned by yaz_errno().

source: The start specifies position of first record to be retrieved and number is the number records.
es: This function is used in conjunction with yaz_search() to specify the maximum number of records to retrieve (number) and the first record position (start).

source: Records in a result set are numbered 1, 2,... $hits where $hits is the count returned by yaz_hits().
es: If this function is not invoked (only yaz_search()) start is set to 1 and number is set to 10.

source: Returns record at position pos or empty string if no record exists at given position.
es: Returns record at position or empty string if no record exists at given position.

source: If type is "string" the record is returned in a string representation suitable for printing (for XML and SUTRS).
es: The argument, type, specifies the form of the returned record.

source: Like yaz_connect() this function is non-blocking and only prepares for a search to be executed later when yaz_wait() is called.
es: yaz_search() prepares for a search on the target with given id.

source: However, in the text representation as used by YAZ a prefix notation is used, that is the operater precedes the operands.
es: The type represents the query type - only "rpn" is supported now in which case the third argument is a prefix notation query as used by YAZ.

source: This function should be called before yaz_search() or yaz_present().
es: This function is used in conjunction with yaz_search() to specify the preferred record syntax for retrieval.

source: If the options array is given that holds options that change the behaviour of yaz_wait().
es: This function carries out networked (blocked) activity for outstanding requests which have been prepared by the functions yaz_connect(), yaz_search(). yaz_wait() returns when all targets have either completed all requests or otherwise completed (in case of errors).

source: YP / NIS Functions
es: NIS funciona

source: yp_errno() returns the error code of the previous operation.
es: yp_errno() retorna el codigo de error de la operacion previa.

source: Possible errors are:
es: Los errores posibles son:

source: 1 args to function are bad
es: 1 args para funcionar son malos

source: 2 RPC failure - domain has been unbound
es: 2 fallo de RPC - dominio ha sido unbound

source: 3 can 't bind to server on this domain
es: 3 no puede unir a servidor en este dominio

source: 4 no such map in server 's domain
es: 4 ningun tal mapa en dominio de servidor

source: 5 no such key in map
es: 5 ninguna tal llave en

source: 6 internal yp server or client error
es: 6 interno yp error de cliente o servidor

source: 7 resource allocation failure
es: 7 fallo de asignacion de recurso

source: 8 no more records in map database
es: 8 ningunos más registros en base de datos de mapa

source: 9 can 't communicate with portmapper
es: 9 no puede comunicar wiTh portmapper

source: 10 can 't communicate with ypbind
es: 10 no puede comunicar con ypbind

source: 11 can 't communicate with ypserv
es: 11 no puede comunicar con ypserv

source: 12 local domain name not set
es: 12 nombre de dominio local no conjunto

source: 13 yp database is bad
es: 13 yp base de datos es malo

source: 14 yp version mismatch
es: 14 yp La version mismatch

source: 15 access violation
es: 15 violacion de acceso

source: 16 database busy
es: 16 base de datos ocupar

source: See also yp_err_string().
es: Ver tambien: yp_err_string

source: Useful to indicate what exactly went wrong.
es: yp_err_string() Retorna el mensaje de error asociado con la operacion previa.Util para indicar que salio mal exactamente.

source: Example for NIS errors
es: Ejemplo para errores de NIS

source: See also yp_errno().
es: Vea tambien: yp errno

source: yp_first() returns the first key-value pair from the named map in the named domain, otherwise FALSE.
es: yp_first - - devuelve la primera clave emparejada con el nombrado mapa.

source: Example for the NIS first
es: string[] yp_first (cadena dominio, cadena mapa)

source: ?php $entry = yp_first( $domain, "passwd.byname"); $key = $entry ["key"]; $value = $entry ["value"]; echo "First entry in this map has key ". $key." and value ". $value;?
es: Ejemplo 1.

source: See also yp-get-default-domain()
es: Ver tambien: yp_get_default_domain yp_errno y yp_err_string

source: yp_get_default_domain() returns the default domain of the node or FALSE.
es: yp_ get_default_domain() Retorna el valor por omision del dominio del nodo o FALSO.

source: Can be used as the domain parameter for successive NIS calls.
es: Puede ser usado el parametro de dominio para sucesivas llamadas a NIS.

source: A NIS domain can be described a group of NIS maps.
es: Un dominio de NIS puede ser descrito en un grupo de mapas NIS.

source: Every host that needs to look up information binds itself to a certain domain.
es: Cada host necesita buscar uniones de informacion en un mismo dominio.

source: Refer to the documents mentioned at the beginning for more detailed information.
es: Acudir a los documentos mencionados en el comienzo para mas informacion.

source: Example for the default domain
es: Ejemplo para el dominio por omision

source: ?php $domain = yp_get_default_domain(); echo "Default NIS domain is: ". $domain;?
es: Ver tambien: yp_ errno (nombre de la funcion) y yp_err_string (nombre de la funcion)

source: This key must be exact.
es: yp_match( nombre de la funcion)() Retorna el valor asociado con la llave pasada fuera del mapa especificado o FALSO. esta llave tiene que ser exacta.

source: Example for NIS match
es: Ejemplo para NIS parejo

source: ?php $entry = yp_match ($domain, "passwd.byname", "joe"); echo "Matched entry is: ". $entry;?
es: Joe:##joe:11111:100:joe usuario: / hogar / j/joe:

source: In this case this could be: joe:##joe:11111:100:Joe User: / home / j/joe: / usr / local / bin / bash
es: User: / usr / local / bin / bash

source: yp_next() returns the next key-value pair in the named map after the specified key or FALSE.
es: yp_next() devuelve el siguiente par de valor tecleado en el mapa de nombres despues de la clave especificada o FALSO.

source: Example for NIS next
es: Ejemplo para NIS siguiente

source: See also yp-get-default-domain().
es: Ver tambien: yp_get_default_domain yp_errno y yp_err_string

source: This functionality was added in PHP 4.0.0.
es: Esta funcionalidad fue añadida en PHP4 Beta 4.

source: Example 1. zend_version() Example
es: Ejemplo 1. zend_version() Example

source: Zlib Compression Functions
es: Funciones de Compresión

source: Preface
es: Siguiente

source: Introduction
es: Introducción

source: PHP has come a long way in the last few years.
es: PHP ha recorrido un largo camino en los últimos años.

source: Growing to be one of the most prominent languages powering the Web was not an easy task.
es: Crecer hasta ser uno de los más importantes lenguajes de programación en entornos Web no ha sido tarea fácil.

source: Those of you interested in briefly seeing how PHP grew out to what it is today, read on.
es: Aquellos interesados en ver brevemente cómo creció PHP hasta lo que es hoy en día, sigan leyendo.

source: PHP succeeds an older product, named PHP / FI.
es: PHP es el heredero de un producto anterior, llamado PHP / FI.

source: PHP / FI was created by Rasmus Lerdorf in 1995, initially as a simple set of Perl scripts for tracking accesses to his online resume.
es: PHP / FI fue creado por Rasmus Lerdorf en 1995, inicialmente como un simple conjunto de scripts de Perl para controlar los accesos a su trabajo online.

source: He named this set of scripts' Personal Home Page Tools'.
es: Llamó a ese conjunto de scripts 'Personal Home Page Tools'.

source: As more functionality was required, Rasmus wrote a much larger C implementation, which was able to communicate with databases, and enabled users to develop simple dynamic Web applications.
es: Según se requería más funcionalidad, Rasmus fue escribiendo una implementación C mucho mayor, que era capaz de comunicarse con bases de datos, y permitía a los usuarios desarrollar sencillas aplicaciones Web dinámicas.

source: Rasmus chose to release the source code for PHP / FI for everybody to see, so that anybody can use it, as well as fix bugs in it and improve the code.
es: Rasmus eligió liberar el código fuente de PHP / FI para que cualquiera pudiese utilizarlo, así como arreglar errores y mejorar el código.

source: PHP / FI, which stood for Personal Home Page / Forms Interpreter, included some of the basic functionality of PHP as we know it today.
es: PHP / FI, que se mantuvo para páginas personales y como intérprete de formularios, incluía algunas de las funcionalidads básicas de PHP tal y como lo conocemos hoy.

source: It had Perl-like variables, automatic interpretation of form variables and HTML embedded syntax.
es: Tenía variables como las de Perl, interpretación automática de variables de formulario y sintaxis embebida HTML.

source: The syntax itself was similar to that of Perl, albeit much more limited, simple, and somewhat inconsistent.
es: La sintaxis por sí misma era similar a la de Perl, aunque mucho más limitada, simple y algo inconsistente.

source: By 1997, PHP / FI 2.0, the second write-up of the C implementation, had a cult of several thousand users around the world (estimated), with approximately 50,000 domains reporting as having it installed, accounting for about 1% of the domains on the Internet.
es: Por 1997, PHP / FI 2.0, la segunda escritura de la implementación en C, tuvo un seguimiento estimado de varios miles de usuarios en todo el mundo, con aproximadamente 50.000 dominios informando que lo tenían instalado, sumando alrededor del 1% de los dominios de Internet.

source: While there were several people contributing bits of code to this project, it was still at large a one-man project.
es: Mientras había mucha gente contribuyendo con bits de código a este proyecto, era todavía en su mayor parte el proyecto de una sola persona.

source: PHP / FI 2.0 was officially released only in November 1997, after spending most of its life in beta releases.
es: PHP / FI 2.0 no se liberó oficialmente hasta Noviembre de 1997, después de gastar la mayoría de su vida en desarrollos beta.

source: It was shortly afterwards succeeded by the first alphas of PHP 3.0.
es: Fue sucedido en breve tiempo por las primeras versiones alfa de PHP 3.0.

source: PHP 3.0 was the first version that closely resembles PHP as we know it today.
es: PHP 3.0 era la primera versión que se parecía fielmente al PHP tal y como lo conocemos hoy en día.

source: It was created by Andi Gutmans and Zeev Suraski in 1997 as a complete rewrite, after they found PHP / FI 2.0 severely underpowered for developing their own eCommerce application.
es: Fue creado por Andi Gutmans y Zeev Zuraski en 1997 reescribiéndolo completamente, después de que encontraran que PHP / FI 2.0 tenía pocas posibilidades para desarrollar su propia aplicación comercial.

source: In an effort to cooperate and start building upon PHP / FI 's existing user-base, Andi, Rasmus and Zeev decided to cooperate and announce PHP 3.0 as the official successor of PHP / FI 2.0, and development of PHP / FI 2.0 was mostly halted.
es: En un esfuerzo para cooperar y empezar a construir sobre la base de PHP / FI existente, Andi, Rasmus y Zeev decidieron cooperar y anunciar PHP 3.0 como el sucesor oficial de PHP / FI 2.0, interrumpiéndose en su mayor parte el desarrollo de PHP / FI 2.0.

source: One of the biggest strengths of PHP 3.0 was its strong extensibility features.
es: Una de las mejores características de PHP 3.0 era su gran extensibilidad.

source: In addition to providing end users with a solid infrastructure for lots of different databases, protocols and APIs, PHP 3.0 's extensibility features attracted dozens of developers to join in and submit new extension modules.
es: Además de proveer a los usuarios finales de una sólida infraestructura para muchísimas bases de datos, protocolos y APIs, las características de extensibilidad de PHP 3.0 atrajeron a docenas de desarrolladores a unirse y enviar nuevos módulos de extensión.

source: Arguably, this was the key to PHP 3.0 's tremendous success.
es: Sin duda, ésta fue la clave del enorme éxito de PHP 3.0.

source: Other key features introduced in PHP 3.0 were the object oriented syntax support and the much more powerful and consistent language syntax.
es: Otras características clave introducidas en PHP 3.0 fueron el soporte de sintáxis orientado a objetos y una sintáxis de lenguaje mucho más potente y consistente.

source: The whole new language was released under a new name, that removed the implication of limited personal use that the PHP / FI 2.0 name held.
es: Todo el nuevo lenguaje fue liberado bajo un nuevo nombre, que borraba la implicación de uso personal limitado que tenía el nombre PHP / FI 2.0.

source: It was named plain 'PHP', with the meaning being a recursive acronym - PHP:
es: Se llamó 'PHP' a secas, con el significado de ser un acrónimo recursivo - PHP:

source: By the end of 1998, PHP grew to an install base of tens of thousands of users (estimated) and hundreds of thousands of Web sites reporting it installed.
es: A finales de 1998, PHP creció hasta una base de instalación de decenas de millares de usuarios (estimados) y cientos de miles de sitios Web informando de su instalación.

source: At its peak, PHP 3.0 was installed on approximately 10% of the Web servers on the Internet.
es: En su apogeo, PHP 3.0 estaba instalado en aproximadamente un 10% de los servidores Web en Internet.

source: PHP 3.0 was officially released in June 1998, after having spent about 9 months in public testing.
es: PHP 3.0 se liberó oficialmente en Junio de 1998, después de haber gastado unos 9 meses en pruebas públicas.

source: By the winter of 1998, shortly after PHP 3.0 was officially released, Andi Gutmans and Zeev Suraski had begun working on a rewrite of PHP 's core.
es: En el invierno de 1998, poco después del lanzamiento oficial de PHP 3.0, Andi Gutmans y Zeev Suraski comenzaron a trabajar en la reescritura del núcleo de PHP.

source: The design goals were to improve performance of complex applications, and improve the modularity of PHP 's code base.
es: Los objetivos de diseño fueron mejorar la ejecución de aplicaciones complejas, y mejorar la modularidad del código base de PHP.

source: Such applications were made possible by PHP 3.0 's new features and support for a wide variety of third party databases and APIs, but PHP 3.0 was not designed to handle such complex applications efficiently.
es: Estas aplicaciones se hicieron posibles por las nuevas características de PHP 3.0 y el apoyo de una gran variedad de bases de datos y APIs de terceros, pero PHP 3.0 no fue diseñado para el mantenimiento tan complejo de aplicaciones eficientemente.

source: The new engine, dubbed 'Zend Engine' (comprised of their first names, Zeev and Andi), met these design goals successfully, and was first introduced in mid 1999.
es: El nuevo motor, apodado 'Motor Zend' (comprimido de sus apellidos, Zeev y Andi), alcanzó estos objetivos de diseño satisfactoriamente, y se introdujo por primera vez a mediados de 1999.

source: PHP 4.0, based on this engine, and coupled with a wide range of additional new features, was officially released in May 2000, almost two years after its predecessor, PHP 3.0.
es: PHP 4.0, basado en este motor, y acoplado con un gran rango de nuevas características adicionales, fue oficialmente liberado en Mayo de 2000, casi dos años después que su predecesor, PHP 3.0.

source: PHP 4 is currently the latest released version of PHP.
es: Además de la mejora de ejecución de esta versión, PHP 4.0 incluía otras características clave como el soporte para la mayoría de los servidores Web, sesiones HTTP, buffers de salida, formas más seguras de controlar las entradas de usuario y muchas nuevas construcciones de lenguaje.

source: Work has already begun on modifying and improving the Zend Engine to integrate the features which were designed for PHP 5.0.
es: PHP 4 es actualmente la última versión liberada de PHP.

source: Today, PHP is being used by hundreds of thousands of developers (estimated), and several million sites report as having it installed, which accounts for over 20% of the domains on the Internet.
es: Ya se está trabajando en modificar y mejorar el motor Zend para integrar las características que se diseñarían para PHP 5.0.

source: The future of PHP is mainly driven by it 's core, the Zend Engine.
es: Hoy, se estima que PHP es usado por cientos de miles de programadores y muchos millones de sitios informan que lo tienen instalado, sumando más del 20% de los dominios en Internet.

source: To get more information on this engine, see it 's webpage.
es: El equipo de desarrollo de PHP incluye docenas de programadores, así como otras docenas de personas trabajando en proyectos relacionados con PHP como PEAR y el proyecto de documentación.

source: Appendixes
es: Apéndices

source: History of PHP related projects
es: Historia de los proyectos relacionados con PHP

source: Appendix A.
es: Apéndice A.

source: As PHP grew, it began to be recognized as a world-wide popular development platform.
es: Según crecía PHP, empezo a ser reconocido como una popular plataforma de desarrollo web.

source: One of the most interesting ways of seeing this trend was by observing the books about PHP that came out throughout the years.
es: Una de las más interesantes formas de ver esta tendencia era observando los libros sobre PHP que han ido llegando a lo largo de los años.

source: Next month followed a German book authored by Egon Schmid, Christian Cartus and Richard Blume.
es: Por lo que nosotros sabemos, el primer libro dedicado a PHP fue 'php - dynamische webauftritte professionell realisieren' - un libro alemán publicado en 1999, siendo los autores Egon Schmid, Christian Cartus y Richard Blume.

source: The first book in English about PHP was published shortly afterwards, and was' Core PHP Programming 'by Leon Atkinson.
es: El primer libro en inglés sobre PHP se publicó poco después, y fue 'Core PHP Programming' de Leon Atkinson.

source: Both of these books covered PHP 3.0.
es: Los dos libros cubrían PHP 3.0.

source: There are over 40 books in English, 50 books in German, and over 20 books in French!
es: Mientras estos dos libros fueron los primeros de su tipo - fueron seguidos por un gran número de libros de una multitud de autores y editores. ¡Existen más 40 libros en inglés, 50 libros en alemán, y más de 20 libros en francés!

source: In addition, you can find books about PHP in many other languages, including Spanish, Korean, Japanese and Hebrew.
es: Además, se pueden encontrar libros sobre PHP en la mayoría de las demás lenguas, incluyendo español, coreano, japonés y hebreo.

source: Clearly, this large number of books, written by different authors, published by many publishers, and their availability in so many languages - are a strong testimony for PHP 's world-wide success.
es: Evidentemente, este gran número de libros, escritos por diferentes autores, publicados por muchos editores, y su disponibilidad en tantas lenguas - son un fuerte testimonio del éxito mundial de PHP.

source: Publications about PHP
es: Publicaciones sobre PHP

source: To the best of our knowledge, the first article about PHP in a hard-copy magazine was published in the Czech mutation of Computerworld in the spring of 1998, and covered PHP 3.0.
es: Por lo que sabemos, el primer artículo sobre PHP en una revista impresa se publicó en French Informatiques Magazines, hacia finales de 1998, y cubría PHP 3.0.

source: As with books, this was the first in a series of many articles published about PHP in various prominent magazines.
es: Como con los libros, fue el primero en una serie de muchos artículos publicados sobre PHP en varias revistas importantes.

source: Articles about PHP appeared in Dr.
es: Artículos sobre PHP han aparecido en Dr.

source: Dobbs, Linux Enterprise, Linux Magazine and many more.
es: Dobbs, Linux Enterprise, Linux Magazine y muchas otras.

source: Articles about migrating ASP-based applications to PHP under Windows even appear on Microsoft 's very own MSDN!
es: Artículos sobre migración de aplicaciones basadas en PHP bajo Windows ¡han aparecido incluso en el MSDN de Microsoft!

source: Books about PHP
es: Libros sobre PHP

source: PEAR, the PHP Extension and Application Repository (originally, PHP Extension and Add-on Repository) is PHP's version of foundation classes, and may grow in the future to be one of the key ways to distribute both PHP and C-based PHP extensions among developers.
es: PEAR, el PHP Extension and Application Repository (originalmente, PHP Extension and Add-on Repository) es la versión de clases de creación de PHP, y puede crecer en el futuro para ser una de las vías clave para distribuir tanto PHP como extensiones PHP basados en C entre desarrolladores.

source: PEAR was born in discussions held in the PHP Developers' Meeting (PDM) held in January 2000 in Tel Aviv.
es: PEAR nació de las discusiones mantenidas en el PHP Developers' Meeting (PDM) transcurrido en Enero de 2000 en Tel Aviv.

source: It was created by Stig S.
es: Fue creado por Stig S.

source: Bakken, and is dedicated to his first-born daughter, Malin Bakken.
es: Bakken, y lo dedicó a su primogénita, Malin Bakken.

source: Since early 2000, PEAR has grown to be a big, significant project with a large number of developers working on implementing common, reusable functionality for the benefit of the entire PHP community.
es: Hasta principios de 2000, PEAR fue creciendo hasta ser un gran y significativo proyecto con un gran número de programadores trabajando en la implementación común, funcionalidad reutilizable para el beneficio de toda la comunidad PHP.
